(function() {

    angular
	.module('busLocApp')
	.controller('whyCtrl', whyCtrl);

    whyCtrl.$inject = ['$sce'];
    function whyCtrl($sce) {
	var vm = this;


	vm.main = {
	    title: 'Энэ web application-ийг яагаад үүсгэх болсон бэ?',
	    content: 'Хот хоорондын зорчигч тээврээр үйлчлүүлж байгаа хүмүүсийг очих газар нь хүлээн авах хүмүүс нь байн байн залгаж хаана явааг нь асуудаг. Энэ үйл ажиллагааг хөнгөлөх зорилгоор хүлээн авах хүн тухайн зорчигчийн зорчиж буй чиглэл, хөдлөсөн цаг огноо, зорчиж буй тээврийн хэрэгслийн жолооч ба улсын дугаар гэсэн мэдээлэл дээр тулгуурлан тухайн зорчиж буй тээврийн хэрэгслийн байршил болон зорьсон газраа очих хугацааг ойролцоогоор мэдэх боломжийг олгоно.'
	}
	vm.main.title = $sce.trustAsHtml(vm.main.title);
	vm.main.content = $sce.trustAsHtml(vm.main.content);
    }
})();


